OpenFOAM-v2506/tutorials/incompressible/pimpleFoam/RAS/rotatingFanInRoom/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00341;

boundaryField
{
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }

    AMI2
    {
        type            cyclicAMI;
        value           uniform 0.00341;
    }

    fan
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }

    door
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.00341;
    }

    outlet
    {
        type            zeroGradient;
    }

    room
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }

    desk
    {
        type            kqRWallFunction;
        value           uniform 0.00341;
    }
}


// ************************************************************************* //
